#define _CRT_SECURE_NO_WARNINGS

#include"SMS.h"
#include"UI.h"


//这一层是界面层 -- 用户可以看到的界面

//--选择 ->  登录界面 or 账号相关
void mainMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                   学生管理系统                     ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 登录选项：                                         ┃\n");
	printf("┃ 1. 学生登录                                        ┃\n");
	printf("┃ 2. 教师登录                                        ┃\n");
	printf("┃ 3. 管理员登录                                      ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 账号相关：                                         ┃\n");
	printf("┃ 4. 密码修改                                        ┃\n");
	printf("┃ 5. 账号注册                                        ┃\n");
	printf("┃ 0. 退出系统                                        ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 请输入相应操作序号或填写账号密码选择身份进行登录。 ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");

}

void logMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                   登录界面                   ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 账号：  _____________________________________┃\n");
	printf("┃ 密码：  _____________________________________┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ return. 返回                                 ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 请输入账号和密码，然后选择操作。             ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");

}
//教师登录界面--选择增删查改/查看班内成绩/返回上一级
void teaMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                   教师登录界面                     ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 1. 增加信息                                        ┃\n");
	printf("┃ 2. 删除信息                                        ┃\n");
	printf("┃ 3. 修改信息                                        ┃\n");
	printf("┃ 4. 查找信息                                        ┃\n");
	printf("┃ 5. 查看班内成绩                                    ┃\n");
	printf("┃ 6. 返回上一级                                      ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 请选择相应操作序号进行操作。                       ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
}

//学生登录界面--选择成绩查询/查询本班成绩/返回上一级
void stuMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                     学生端界面                     ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 1. 成绩查询                                        ┃\n");
	printf("┃ 2. 返回上一级                                      ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 请选择相应操作序号进行操作。                       ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
}

//管理员登录界面--增删改查账密以及学生信息，从文件录入所有账号密码，从文件导出所有账号密码，返回上一级
//管理员里面删除账号密码看作删除学生信息
void admMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                 管理员登录界面                     ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 1. 删除账号密码                                    ┃\n");
	printf("┃ 2. 修改账号密码                                    ┃\n");
	printf("┃ 3. 查找账号密码                                    ┃\n");
	printf("┃ 4. 从文件读取所有账号密码                          ┃\n");
	printf("┃ 5. 从文件导出所有账号密码                         ┃\n");
	printf("┃ 6. 添加教师账号                                    ┃\n");
	printf("┃ 0.返回上一级                                     ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ┃\n");
	printf("┃ 请选择相应操作序号进行操作。                       ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");

}

void registerMenu()
{
	printf("┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("┃                   账号注册界面                ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 学号：    ____________________________________┃\n");
	printf("┃ 请输入6 - 20位字母、数字或下划线组合          ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 密码：  ______________________________________┃\n");
	printf("┃ 请输入8 - 16位包含字母和数字的密码            ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 确认密码：  __________________________________┃\n");
	printf("┃ 请再次输入相同的密码以确认                    ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 0. 返回                                       ┃\n");
	printf("┃ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┃\n");
	printf("┃ 请填写以上信息并选择相应操作进行账号注册。    ┃\n");
	printf("┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
}